## [k8s_intro](https://nysdin.app.spacelift.io/stack/k8s_intro/run/01GY9VE9TTJVSX3CP5XJRPW4E0) plan logs

<details>
<summary>Click here to expand</summary>

```
[01GY8E6HZWYY8ZAA5HMT387884] Planning changes with 0 custom hooks...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.spacelift_test will be created
  + resource "aws_ssm_parameter" "spacelift_test" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/spacelift/test"
      + tags_all       = {
          + "Managed_by" = "nysdin/k8s_intro"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.spacelift_test2 will be created
  + resource "aws_ssm_parameter" "spacelift_test2" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/spacelift/test"
      + tags_all       = {
          + "Managed_by" = "nysdin/k8s_intro"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

[01GY8E6HZWYY8ZAA5HMT387884] Changes are GO
[01GY8E6HZWYY8ZAA5HMT387884] Uploading the list of managed resources...
[01GY8E6HZWYY8ZAA5HMT387884] Please be aware that Run changes calculation includes Terraform output changes.
[01GY8E6HZWYY8ZAA5HMT387884] Resource list upload is GO
[01GY8E6HZWYY8ZAA5HMT387884] Generating JSON representation of the plan...
[01GY8E6HZWYY8ZAA5HMT387884] JSON representation is GO
[01GY8E6HZWYY8ZAA5HMT387884] Loading custom plan policy inputs...
[01GY8E6HZWYY8ZAA5HMT387884] 0 custom plan policy inputs found
[01GY8E6HZWYY8ZAA5HMT387884] No plan policies to evaluate
```

</details>